kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_adc.h
/****************************************************************************
 * arch/arm/src/stm32h5/hardware/stm32h62xx_adc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5_ADC_H
#define __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5_ADC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

/* Register Offsets for each ADC (ADC1-2).  At offset 0x0000 for master and
 * offset 0x0100 for slave.
 */

#define STM32H5_ADC_ISR_OFFSET         0x0000  /* ADC interrupt and status register */
#define STM32H5_ADC_IER_OFFSET         0x0004  /* ADC interrupt enable register */
#define STM32H5_ADC_CR_OFFSET          0x0008  /* ADC control register */
#define STM32H5_ADC_CFGR_OFFSET        0x000c  /* ADC configuration register */
#define STM32H5_ADC_CFGR2_OFFSET       0x0010  /* ADC configuration register 2 */
#define STM32H5_ADC_SMPR1_OFFSET       0x0014  /* ADC sample time register 1 */
#define STM32H5_ADC_SMPR2_OFFSET       0x0018  /* ADC sample time register 2 */
#define STM32H5_ADC_TR1_OFFSET         0x0020  /* ADC watchdog threshold register 1 */
#define STM32H5_ADC_TR2_OFFSET         0x0024  /* ADC watchdog threshold register 2 */
#define STM32H5_ADC_TR3_OFFSET         0x0028  /* ADC watchdog threshold register 3 */
#define STM32H5_ADC_SQR1_OFFSET        0x0030  /* ADC regular sequence register 1 */
#define STM32H5_ADC_SQR2_OFFSET        0x0034  /* ADC regular sequence register 2 */
#define STM32H5_ADC_SQR3_OFFSET        0x0038  /* ADC regular sequence register 3 */
#define STM32H5_ADC_SQR4_OFFSET        0x003c  /* ADC regular sequence register 4 */
#define STM32H5_ADC_DR_OFFSET          0x0040  /* ADC regular data register */
#define STM32H5_ADC_JSQR_OFFSET        0x004c  /* ADC injected sequence register */
#define STM32H5_ADC_OFR1_OFFSET        0x0060  /* ADC offset register 1 */
#define STM32H5_ADC_OFR2_OFFSET        0x0064  /* ADC offset register 2 */
#define STM32H5_ADC_OFR3_OFFSET        0x0068  /* ADC offset register 3 */
#define STM32H5_ADC_OFR4_OFFSET        0x006c  /* ADC offset register 4 */
#define STM32H5_ADC_JDR1_OFFSET        0x0080  /* ADC injected data register 1 */
#define STM32H5_ADC_JDR2_OFFSET        0x0084  /* ADC injected data register 2 */
#define STM32H5_ADC_JDR3_OFFSET        0x0088  /* ADC injected data register 3 */
#define STM32H5_ADC_JDR4_OFFSET        0x008c  /* ADC injected data register 4 */
#define STM32H5_ADC_AWD2CR_OFFSET      0x00a0  /* ADC analog watchdog 2 configuration register */
#define STM32H5_ADC_AWD3CR_OFFSET      0x00a4  /* ADC analog watchdog 3 configuration register */
#define STM32H5_ADC_DIFSEL_OFFSET      0x00b0  /* ADC differential mode selection register 2 */
#define STM32H5_ADC_CALFACT_OFFSET     0x00b4  /* ADC calibration factors */
#define STM32H5_ADC_OR_OFFSET          0x00c8  /* ADC Option Register */

/* Master and Slave ADC Common Registers */

#define STM32H5_ADC_CSR_OFFSET         0x0000  /* Common status register */
#define STM32H5_ADC_CCR_OFFSET         0x0008  /* Common control register */
#define STM32H5_ADC_CDR_OFFSET         0x000c  /* Common Regular Data register for Dual Mode*/
#define STM32H5_ADC_HWCFGR0_OFFSET     0x00f0  /* Hardware Configuration Register */
#define STM32H5_ADC_VERR_OFFSET        0x00f4  /* Version Register */
#define STM32H5_ADC_IPDR_OFFSET        0x00f8  /* Size Identification Register */
#define STM32H5_ADC_SIDR_OFFSET        0x00fc  /* Size Identification Register */


/* Register Addresses *******************************************************/

#define STM32H5_ADC1_ISR               (STM32H5_ADC1_BASE+STM32H5_ADC_ISR_OFFSET)
#define STM32H5_ADC1_IER               (STM32H5_ADC1_BASE+STM32H5_ADC_IER_OFFSET)
#define STM32H5_ADC1_CR                (STM32H5_ADC1_BASE+STM32H5_ADC_CR_OFFSET)
#define STM32H5_ADC1_CFGR              (STM32H5_ADC1_BASE+STM32H5_ADC_CFGR_OFFSET)
#define STM32H5_ADC1_CFGR2             (STM32H5_ADC1_BASE+STM32H5_ADC_CFGR2_OFFSET)
#define STM32H5_ADC1_SMPR1             (STM32H5_ADC1_BASE+STM32H5_ADC_SMPR1_OFFSET)
#define STM32H5_ADC1_SMPR2             (STM32H5_ADC1_BASE+STM32H5_ADC_SMPR2_OFFSET)
#define STM32H5_ADC1_TR1               (STM32H5_ADC1_BASE+STM32H5_ADC_TR1_OFFSET)
#define STM32H5_ADC1_TR2               (STM32H5_ADC1_BASE+STM32H5_ADC_TR2_OFFSET)
#define STM32H5_ADC1_TR3               (STM32H5_ADC1_BASE+STM32H5_ADC_TR3_OFFSET)
#define STM32H5_ADC1_SQR1              (STM32H5_ADC1_BASE+STM32H5_ADC_SQR1_OFFSET)
#define STM32H5_ADC1_SQR2              (STM32H5_ADC1_BASE+STM32H5_ADC_SQR2_OFFSET)
#define STM32H5_ADC1_SQR3              (STM32H5_ADC1_BASE+STM32H5_ADC_SQR3_OFFSET)
#define STM32H5_ADC1_SQR4              (STM32H5_ADC1_BASE+STM32H5_ADC_SQR4_OFFSET)
#define STM32H5_ADC1_DR                (STM32H5_ADC1_BASE+STM32H5_ADC_DR_OFFSET)
#define STM32H5_ADC1_JSQR              (STM32H5_ADC1_BASE+STM32H5_ADC_JSQR_OFFSET)
#define STM32H5_ADC1_OFR1              (STM32H5_ADC1_BASE+STM32H5_ADC_OFR1_OFFSET)
#define STM32H5_ADC1_OFR2              (STM32H5_ADC1_BASE+STM32H5_ADC_OFR2_OFFSET)
#define STM32H5_ADC1_OFR3              (STM32H5_ADC1_BASE+STM32H5_ADC_OFR3_OFFSET)
#define STM32H5_ADC1_OFR4              (STM32H5_ADC1_BASE+STM32H5_ADC_OFR4_OFFSET)
#define STM32H5_ADC1_JDR1              (STM32H5_ADC1_BASE+STM32H5_ADC_JDR1_OFFSET)
#define STM32H5_ADC1_JDR2              (STM32H5_ADC1_BASE+STM32H5_ADC_JDR2_OFFSET)
#define STM32H5_ADC1_JDR3              (STM32H5_ADC1_BASE+STM32H5_ADC_JDR3_OFFSET)
#define STM32H5_ADC1_JDR4              (STM32H5_ADC1_BASE+STM32H5_ADC_JDR4_OFFSET)
#define STM32H5_ADC1_AWD2CR            (STM32H5_ADC1_BASE+STM32H5_ADC_AWD2CR_OFFSET)
#define STM32H5_ADC1_AWD3CR            (STM32H5_ADC1_BASE+STM32H5_ADC_AWD3CR_OFFSET)
#define STM32H5_ADC1_DIFSEL            (STM32H5_ADC1_BASE+STM32H5_ADC_DIFSEL_OFFSET)
#define STM32H5_ADC1_CALFACT           (STM32H5_ADC1_BASE+STM32H5_ADC_CALFACT_OFFSET)
#define STM32H5_ADC2_OR                (STM32H5_ADC1_BASE+STM32H5_ADC_OR_OFFSET)

#define STM32H5_ADC2_ISR               (STM32H5_ADC2_BASE+STM32H5_ADC_ISR_OFFSET)
#define STM32H5_ADC2_IER               (STM32H5_ADC2_BASE+STM32H5_ADC_IER_OFFSET)
#define STM32H5_ADC2_CR                (STM32H5_ADC2_BASE+STM32H5_ADC_CR_OFFSET)
#define STM32H5_ADC2_CFGR              (STM32H5_ADC2_BASE+STM32H5_ADC_CFGR_OFFSET)
#define STM32H5_ADC2_CFGR2             (STM32H5_ADC2_BASE+STM32H5_ADC_CFGR2_OFFSET)
#define STM32H5_ADC2_SMPR1             (STM32H5_ADC2_BASE+STM32H5_ADC_SMPR1_OFFSET)
#define STM32H5_ADC2_SMPR2             (STM32H5_ADC2_BASE+STM32H5_ADC_SMPR2_OFFSET)
#define STM32H5_ADC2_TR1               (STM32H5_ADC2_BASE+STM32H5_ADC_TR1_OFFSET)
#define STM32H5_ADC2_TR2               (STM32H5_ADC2_BASE+STM32H5_ADC_TR2_OFFSET)
#define STM32H5_ADC2_TR3               (STM32H5_ADC2_BASE+STM32H5_ADC_TR3_OFFSET)
#define STM32H5_ADC2_SQR1              (STM32H5_ADC2_BASE+STM32H5_ADC_SQR1_OFFSET)
#define STM32H5_ADC2_SQR2              (STM32H5_ADC2_BASE+STM32H5_ADC_SQR2_OFFSET)
#define STM32H5_ADC2_SQR3              (STM32H5_ADC2_BASE+STM32H5_ADC_SQR3_OFFSET)
#define STM32H5_ADC2_SQR4              (STM32H5_ADC2_BASE+STM32H5_ADC_SQR4_OFFSET)
#define STM32H5_ADC2_DR                (STM32H5_ADC2_BASE+STM32H5_ADC_DR_OFFSET)
#define STM32H5_ADC2_JSQR              (STM32H5_ADC2_BASE+STM32H5_ADC_JSQR_OFFSET)
#define STM32H5_ADC2_OFR1              (STM32H5_ADC2_BASE+STM32H5_ADC_OFR1_OFFSET)
#define STM32H5_ADC2_OFR2              (STM32H5_ADC2_BASE+STM32H5_ADC_OFR2_OFFSET)
#define STM32H5_ADC2_OFR3              (STM32H5_ADC2_BASE+STM32H5_ADC_OFR3_OFFSET)
#define STM32H5_ADC2_OFR4              (STM32H5_ADC2_BASE+STM32H5_ADC_OFR4_OFFSET)
#define STM32H5_ADC2_JDR1              (STM32H5_ADC2_BASE+STM32H5_ADC_JDR1_OFFSET)
#define STM32H5_ADC2_JDR2              (STM32H5_ADC2_BASE+STM32H5_ADC_JDR2_OFFSET)
#define STM32H5_ADC2_JDR3              (STM32H5_ADC2_BASE+STM32H5_ADC_JDR3_OFFSET)
#define STM32H5_ADC2_JDR4              (STM32H5_ADC2_BASE+STM32H5_ADC_JDR4_OFFSET)
#define STM32H5_ADC2_AWD2CR            (STM32H5_ADC2_BASE+STM32H5_ADC_AWD2CR_OFFSET)
#define STM32H5_ADC2_AWD3CR            (STM32H5_ADC2_BASE+STM32H5_ADC_AWD3CR_OFFSET)
#define STM32H5_ADC2_DIFSEL            (STM32H5_ADC2_BASE+STM32H5_ADC_DIFSEL_OFFSET)
#define STM32H5_ADC2_CALFACT           (STM32H5_ADC2_BASE+STM32H5_ADC_CALFACT_OFFSET)
#define STM32H5_ADC2_OR                (STM32H5_ADC2_BASE+STM32H5_ADC_OR_OFFSET)

#define STM32H5_ADC_CSR                (STM32H5_ADCCMN_BASE+STM32H5_ADC_CSR_OFFSET)
#define STM32H5_ADC_CCR                (STM32H5_ADCCMN_BASE+STM32H5_ADC_CCR_OFFSET)
#define STM32H5_ADC_CDR                (STM32H5_ADCCMN_BASE+STM32H5_ADC_CDR_OFFSET)
#define STM32H5_ADC_HWCFGR0            (STM32H5_ADCCMN_BASE+STM32H5_ADC_HWCFGR0_OFFSET)
#define STM32H5_ADC_VERR               (STM32H5_ADCCMN_BASE+STM32H5_ADC_VERR_OFFSET)
#define STM32H5_ADC_IPDR               (STM32H5_ADCCMN_BASE+STM32H5_ADC_IPDR_OFFSET)
#define STM32H5_ADC_SIDR               (STM32H5_ADCCMN_BASE+STM32H5_ADC_SIDR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* ADC interrupt and status register (ISR) and
 * ADC interrupt enable register (IER)
 */

#define ADC_INT_ADRDY                (1 << 0)  /* Bit 0:  ADC ready */
#define ADC_INT_EOSMP                (1 << 1)  /* Bit 1:  End of sampling flag */
#define ADC_INT_EOC                  (1 << 2)  /* Bit 2:  End of conversion */
#define ADC_INT_EOS                  (1 << 3)  /* Bit 3:  End of regular sequence flag */
#define ADC_INT_OVR                  (1 << 4)  /* Bit 4:  Overrun */
#define ADC_INT_JEOC                 (1 << 5)  /* Bit 5:  Injected channel end of conversion */
#define ADC_INT_JEOS                 (1 << 6)  /* Bit 6:  Injected channel end of sequence flag */
#define ADC_INT_AWD1                 (1 << 7)  /* Bit 7:  Analog watchdog 1 flag */
#define ADC_INT_AWD2                 (1 << 8)  /* Bit 8:  Analog watchdog 2 flag */
#define ADC_INT_AWD3                 (1 << 9)  /* Bit 9:  Analog watchdog 3 flag */
#define ADC_INT_JQOVF                (1 << 10) /* Bit 10: Injected context queue overflow */

#define ADC_INT_MASK                 (0x7ff)

/* ADC control register */

#define ADC_CR_ADEN                  (1 << 0)  /* Bit 0: ADC enable control */
#define ADC_CR_ADDIS                 (1 << 1)  /* Bit 1: ADC disable command */
#define ADC_CR_ADSTART               (1 << 2)  /* Bit 2: ADC start of regular conversion */
#define ADC_CR_JADSTART              (1 << 3)  /* Bit 3: ADC start of injected conversion */
#define ADC_CR_ADSTP                 (1 << 4)  /* Bit 4: ADC stop of regular conversion command */
#define ADC_CR_JADSTP                (1 << 5)  /* Bit 5: ADC stop of injected conversion command */
#define ADC_CR_ADVREGEN              (1 << 28) /* Bit 28: ADC voltage regulator enable */
#define ADC_CR_DEEPPWD               (1 << 29) /* Bit 29: Deep-power-down enable */
#define ADC_CR_ADCALDIF              (1 << 30) /* Bit 30: Differential mode for calibration */
#define ADC_CR_ADCAL                 (1 << 31) /* Bit 31: ADC calibration */

/* ADC configuration register */

#define ADC_CFGR_DMAEN               (1 << 0)  /* Bit 0: Direct memory access enable */
#define ADC_CFGR_DMACFG              (1 << 1)  /* Bit 1: Direct memory access configuration */
#define ADC_CFGR_DFSDMCFG            (1 << 2)  /* Bit 2: DFSDM mode configuration */
#define ADC_CFGR_RES_SHIFT           (3)       /* Bits 3-4: Data resolution */
#define ADC_CFGR_RES_MASK            (3 << ADC_CFGR_RES_SHIFT)
#  define ADC_CFGR_RES_12BIT         (0 << ADC_CFGR_RES_SHIFT)         /* 12-bit resolution */
#  define ADC_CFGR_RES_10BIT         (1 << ADC_CFGR_RES_SHIFT)         /* 10-bit resolution */
#  define ADC_CFGR_RES_8BIT          (2 << ADC_CFGR_RES_SHIFT)         /* 8-bit resolution */
#  define ADC_CFGR_RES_6BIT          (3 << ADC_CFGR_RES_SHIFT)         /* 6-bit resolution */
#define ADC_CFGR_ALIGN               (1 << 5)                          /* Bit 5: Data Alignment */
#define ADC_CFGR_EXTSEL_SHIFT        (6)                               /* Bits 6-9: External Event Select for regular group */
#define ADC_CFGR_EXTSEL_MASK         (15 << ADC_CFGR_EXTSEL_SHIFT)
#  define ADC_CFGR_EXTSEL(event)     ((event) << ADC_CFGR_EXTSEL_SHIFT)/* Event = 0..15 */
#  define ADC_CFGR_EXTSEL_T1CC1      (0x0 << ADC_CFGR_EXTSEL_SHIFT)    /* 0000: Timer 1 CC1 event */
#  define ADC_CFGR_EXTSEL_T1CC2      (0x01 << ADC_CFGR_EXTSEL_SHIFT)   /* 0001: Timer 1 CC2 event */
#  define ADC_CFGR_EXTSEL_T1CC3      (0x02 << ADC_CFGR_EXTSEL_SHIFT)   /* 0010: Timer 1 CC3 event */
#  define ADC_CFGR_EXTSEL_T2CC4      (0x03 << ADC_CFGR_EXTSEL_SHIFT)   /* 0011: Timer 2 CC4 event */
#  define ADC_CFGR_EXTSEL_T3TRGO     (0x04 << ADC_CFGR_EXTSEL_SHIFT)   /* 0100: Timer 3 TRGO event */
#    define ADC_CFGR_EXTSEL_T4CC4    (0x05 << ADC_CFGR_EXTSEL_SHIFT)   /* 0101: Timer 4 CC4 event */
#  define ADC_CFGR_EXTSEL_EXTI11     (0x06 << ADC_CFGR_EXTSEL_SHIFT)   /* 0110: EXTI line 11 */
#    define ADC_CFGR_EXTSEL_T8TRGO   (0x07 << ADC_CFGR_EXTSEL_SHIFT)   /* 0111: Timer 8 TRGO event */
#    define ADC_CFGR_EXTSEL_T8TRGO2  (0x08 << ADC_CFGR_EXTSEL_SHIFT)   /* 1000: Timer 8 TRGO2 event */
#  define ADC_CFGR_EXTSEL_T1TRGO     (0x09 << ADC_CFGR_EXTSEL_SHIFT)   /* 1001: Timer 1 TRGO event */
#  define ADC_CFGR_EXTSEL_T1TRGO2    (0x0a << ADC_CFGR_EXTSEL_SHIFT)   /* 1010: Timer 1 TRGO2 event */
#  define ADC_CFGR_EXTSEL_T2TRGO     (0x0b << ADC_CFGR_EXTSEL_SHIFT)   /* 1011: Timer 2 TRGO event */
#    define ADC_CFGR_EXTSEL_T4TRGO   (0x0c << ADC_CFGR_EXTSEL_SHIFT)   /* 1100: Timer 4 TRGO event */
#  define ADC_CFGR_EXTSEL_T6TRGO     (0x0d << ADC_CFGR_EXTSEL_SHIFT)   /* 1101: Timer 6 TRGO event */
#  define ADC_CFGR_EXTSEL_T15TRGO    (0x0e << ADC_CFGR_EXTSEL_SHIFT)   /* 1110: Timer 15 TRGO event */
#    define ADC_CFGR_EXTSEL_T3CC4    (0x0f << ADC_CFGR_EXTSEL_SHIFT)   /* 1111: Timer 3 CC4 event */
#define ADC_CFGR_EXTEN_SHIFT         (10)                              /* Bits 10-11: External trigger/polarity selection regular channels */
#define ADC_CFGR_EXTEN_MASK          (3 << ADC_CFGR_EXTEN_SHIFT)
#  define ADC_CFGR_EXTEN(pol)        ((pol) << ADC_CFGR_EXTEN_SHIFT)   /* Trigger polarity = 0..3 */
#  define ADC_CFGR_EXTEN_NONE        (0 << ADC_CFGR_EXTEN_SHIFT)       /* Trigger detection disabled */
#  define ADC_CFGR_EXTEN_RISING      (1 << ADC_CFGR_EXTEN_SHIFT)       /* Trigger detection on the rising edge */
#  define ADC_CFGR_EXTEN_FALLING     (2 << ADC_CFGR_EXTEN_SHIFT)       /* Trigger detection on the falling edge */
#  define ADC_CFGR_EXTEN_BOTH        (3 << ADC_CFGR_EXTEN_SHIFT)       /* Trigger detection on both edges */
#define ADC_CFGR_OVRMOD              (1 << 12)                         /* Bit 12: Overrun Mode */
#define ADC_CFGR_CONT                (1 << 13)                         /* Bit 13: Continuous mode for regular conversions */
#define ADC_CFGR_AUTDLY              (1 << 14)                         /* Bit 14: Delayed conversion mode */
#define ADC_CFGR_DISCEN              (1 << 16)                         /* Bit 16: Discontinuous mode on regular channels */
#define ADC_CFGR_DISCNUM_SHIFT       (17)                              /* Bits 17-19: Discontinuous mode channel count */
#define ADC_CFGR_DISCNUM_MASK        (7 << ADC_CFGR_DISCNUM_SHIFT)
#  define ADC_CFGR_DISCNUM(n)        (((n) - 1) << ADC_CFGR_DISCNUM_SHIFT)
                                                                       /* n = 1..8 channels */

#define ADC_CFGR_JDISCEN             (1 << 20) /* Bit 20: Discontinuous mode on injected channels */
#define ADC_CFGR_JQM                 (1 << 21) /* Bit 21: JSQR queue mode */
#define ADC_CFGR_AWD1SGL             (1 << 22) /* Bit 22: Enable watchdog on single/all channels */
#define ADC_CFGR_AWD1EN              (1 << 23) /* Bit 23: Analog watchdog enable 1 regular channels */
#define ADC_CFGR_JAWD1EN             (1 << 22) /* Bit 22: Analog watchdog enable 1 injected channels */
#define ADC_CFGR_JAUTO               (1 << 25) /* Bit 25: Automatic Injected Group conversion */
#define ADC_CFGR_AWD1CH_SHIFT        (26)      /* Bits 26-30: Analog watchdog 1 channel select bits */
#define ADC_CFGR_AWD1CH_MASK         (31 << ADC_CFGR_AWD1CH_SHIFT)
#  define ADC_CFGR_AWD1CH_DISABLED   (0 << ADC_CFGR_AWD1CH_SHIFT)
#define ADC_CFGR_JQDIS               (1 << 31) /* Bit 31: Injected Queue disable */

/* ADC configuration register 2 */

